//
//  InsertionSort01.swift
//  算法
//
//  Created by DianLee on 2021/7/12.
//

import Cocoa

/// 插入排序01
class InsertionSort01: BaseSort {
    /**
     1. 从第一个元素开始，默认为第一个元素是已经被排序的
     2. 取出下一个元素，在已排序的序列中从后向前扫描
     3. 如果该元素大于取出元素，则向后挪动
     4. 重复步骤3 直到在已排序好的序列中找到小于或等于取出的元素的位置
     5. 将取出的元素插入带该元素的位置
     6. 重复步骤 2~5
     */
    override func sortAction() {
        for i in 1..<arrayList.count {
            var begin = i
            let value = arrayList[begin]
            while begin > 0 && cmpValue(arrayList[begin-1], value) > 0 {
                arrayList[begin] = arrayList[begin-1]
                begin -= 1
            }
            arrayList[begin] = value
        }
    }
}
//[250, 677, 222, 988, 68, 908, 656, 164, 192, 8, 501, 259, 730, 415, 720, 558, 1, 900, 184, 622, 558, 980, 837, 164, 683, 645, 791, 414, 982, 840, 667, 82, 152, 753, 834, 81, 771, 714, 114, 726, 409, 963, 391, 637, 471, 926, 674, 740, 308, 260, 441, 955, 900, 800, 934, 778, 942, 974, 56, 989, 812, 54, 828, 75, 465, 131, 823, 500, 345, 34, 252, 191, 641, 638, 645, 31, 964, 32, 990, 182, 669, 896, 165, 826, 770, 274, 652, 222, 548, 495, 492, 847, 514, 507, 952, 61, 477, 780, 853, 256]
